In [11]:
server = Data()
server.first_load()

In [12]:
from azure.cosmos import CosmosClient
import json
from Utils.data import Data
from Utils.request import Request

In [17]:
request = Request()

In [21]:
data = request.big_data

In [22]:
data

,price,restaurant_id,orderable_id,orderable_name,order_id,amount_of_item,order_item_id,creation_date_order,customer_id,opening_hours,...,restaurant_name,real_price,day_of_week,day_name,day_of_month,day_of_year,month,month_name,year,week
0,17.122222,244,1613,Peach tart,145486,3,395579,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,51.366667,2,Wednesday,19,353,12,December,2018,51
1,24.600000,244,1611,San Pellegrino Sparkling Water,145486,2,395576,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,49.200000,2,Wednesday,19,353,12,December,2018,51
2,22.500000,244,1606,Cinnamon Raisin Danish ...1.60,145486,1,395577,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,22.500000,2,Wednesday,19,353,12,December,2018,51
3,26.300000,244,1612,Steak Tartare - with quail egg,145486,2,395578,2018-12-19 18:03:00,4845,13:00-23:00,...,S.S. Constitution,52.600000,2,Wednesday,19,353,12,December,2018,51
4,17.122222,244,1613,Peach tart,95543,3,259604,2018-06-30 15:09:00,6359,13:00-23:00,...,S.S. Constitution,51.366667,5,Saturday,30,181,6,June,2018,26
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
486026,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,141930,1,385873,2018-12-07 21:53:00,7963,13:00-23:00,...,Harvard University,22.200000,4,Friday,7,341,12,December,2018,49
486027,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,60294,1,164039,2018-02-18 18:00:00,5235,13:00-23:00,...,Harvard University,22.200000,6,Sunday,18,49,2,February,2018,7
486028,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,36661,1,100134,2017-11-18 15:01:00,9291,13:00-23:00,...,Harvard University,22.200000,5,Saturday,18,322,11,November,2017,46
486029,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,137324,1,373340,2018-11-23 15:11:00,24557,13:00-23:00,...,Harvard University,22.200000,4,Friday,23,327,11,November,2018,47
486030,22.200000,228,1498,Fried Scallops (10) w. Beef Fried Rice,71570,1,194633,2018-04-02 20:17:00,17064,13:00-23:00,...,Harvard University,22.200000,0,Monday,2,92,4,April,2018,14

In [35]:
data.drop(data.loc[(data["city"] == "unknown")].index,inplace=True)

In [36]:
data[['city']]

                 city
0       San Francisco
1       San Francisco
2       San Francisco
3       San Francisco
4       San Francisco
...               ...
486026       New York
486027       New York
486028       New York
486029       New York
486030       New York

[478567 rows x 1 columns]

In [37]:
data['city'].value_counts()

New York         316679
San Francisco    161888
Name: city, dtype: int64

In [42]:
df = request.revenue_cities()

In [45]:
df['real_price'][0]

15455869.50786285

In [47]:
df_dishes = request.least_expensive_dishes()
df_dishes

        order_id  real_price
71404      72465         8.2
105023    106566         8.2
69597      70634         8.2
8887        9062         8.2
148510    150692         8.2
...          ...         ...
154356    156614       407.4
173361    175890       408.0
151865    154086       417.9
151714    153934       429.4
161204    163566       438.3

[176152 rows x 2 columns]

In [57]:
request.revenue_streets()

              street  real_price
131        E 52nd St    233528.7
355       W 163rd St    202708.5
124        E 17th St    189369.4
7             3rd Pl    177147.2
380       W Broadway    165769.7
..               ...         ...
166       Freeman Ct       891.7
274    Peninsula Ave       888.5
206          Juri St       883.4
234       Marengo St       691.8
22   Atalaya Terrace        84.8

[388 rows x 2 columns]

In [73]:
df_city_year = request.big_data[['year']]
df_city_year

        year
0       2018
1       2018
2       2018
3       2018
4       2018
...      ...
486026  2018
486027  2018
486028  2017
486029  2018
486030  2018

[478567 rows x 1 columns]

In [54]:
request.revenue_city_year()

            city    real_price
0       New York  1.545587e+07
1  San Francisco  7.006460e+06

In [77]:
request.least_expensive_dishes()

        order_id  real_price
71404      72465         8.2
105023    106566         8.2
69597      70634         8.2
8887        9062         8.2
148510    150692         8.2
...          ...         ...
154356    156614       407.4
173361    175890       408.0
151865    154086       417.9
151714    153934       429.4
161204    163566       438.3

[176152 rows x 2 columns]